Pizza-Cluster/app/controllers/logins_controller.rb

SELECT "logins".* FROM "logins"
---
  def index
    @logins = Login.all

INSERT INTO "logins" ("Email", "Password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Email", "notsoimportant11@gmail.com"], ["Password", ""], ["created_at", "2017-07-13 07:04:48.742134"], ["updated_at", "2017-07-13 07:04:48.742134"]]
---
  def create
    @login = Login.new(login_params)

    respond_to do |format|
      if @login.save

UPDATE "logins" SET "Email" = ?, "updated_at" = ? WHERE "logins"."id" = ?  [["Email", ""], ["updated_at", "2017-07-14 18:16:31.813160"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @login.update(login_params)

SELECT  "logins".* FROM "logins" WHERE "logins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_login
      @login = Login.find(params[:id])