pizzacluster/app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE (username = 'c' or email = 'c') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
	def startsession
		user = User.where("username = ? or email = ?", params[:session][:uid],params[:session][:uid] ).first