pizzacluster/app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE (username = 'sadik' or email = 'sadik') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
	def authenticate
		user = User.where("username = ? or email = ?", params[:session][:uid],params[:session][:uid] ).first