pizzacluster/app/controllers/user_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-07-14 08:20:17.865308"], ["updated_at", "2017-07-14 08:20:17.865308"]]
---
	def create
		@user = User.new
		@user.name = params[:name]
		@user.lastname = params[:lastname]
		@user.username = params[:username]
		@user.email = params[:email]
		@user.password = params[:password]




		if @user.save!